#Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#*Пример:*
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]

source = [2,3,4,5,6]
res = []

for i in range(len(source) - len(source)//2):
    res.append(source[i]*source[-1*(i+1)])

print(res)